In [ ]:
Question 6 : Create a database named ECommerceDB and perform the following
tasks:
1. Create the following tables with appropriate data types and constraints:
● Categories
○ CategoryID (INT, PRIMARY KEY)
○ CategoryName (VARCHAR(50), NOT NULL, UNIQUE)
● Products
○ ProductID (INT, PRIMARY KEY)
○ ProductName (VARCHAR(100), NOT NULL, UNIQUE)
○ CategoryID (INT, FOREIGN KEY → Categories)
○ Price (DECIMAL(10,2), NOT NULL)
○ StockQuantity (INT)
● Customers
○ CustomerID (INT, PRIMARY KEY)
○ CustomerName (VARCHAR(100), NOT NULL)
○ Email (VARCHAR(100), UNIQUE)
○ JoinDate (DATE)
● Orders
○ OrderID (INT, PRIMARY KEY)
○ CustomerID (INT, FOREIGN KEY → Customers)
○ OrderDate (DATE, NOT NULL)
○ TotalAmount (DECIMAL(10,2))
2. Insert the following records into each table
● Categories
CategoryID Category Name
1 Electronics
2 Books
3 Home Goods
4 Apparel                                                                                                                                                       ● Products
ProductID ProductName CategoryID Price StockQuantity
101 Laptop Pro 1 1200.00 50
102 SQL
Handbook
2 45.50 200
103 Smart Speaker 1 99.99 150
104 Coffee Maker 3 75.00 80
105 Novel : The
Great SQL
2 25.00 120
106 Wireless
Earbuds
1 150.00 100
107 Blender X 3 120.00 60
108 T-Shirt Casual 4 20.00 300                                                                                                                 ● Customers
CustomerID CustomerName Email Joining Date
1 Alice Wonderland alice@example.com 2023-01-10
2 Bob the Builder bob@example.com 2022-11-25
3 Charlie Chaplin charlie@example.com 2023-03-01
4 Diana Prince diana@example.com 2021-04-26                                                                                                  ● Orders
OrderID CustomerID OrderDate TotalAmount
1001 1 2023-04-26 1245.50
1002 2 2023-10-12 99.99
1003 1 2023-07-01 145.00
1004 3 2023-01-14 150.00
1005 2 2023-09-24 120.00
1006 1 2023-06-19 20.00

Program =>

-- 1. Create Database
CREATE DATABASE ECommerceDB;

-- 2. Use Database
USE ECommerceDB;

-- 3. Create Tables

CREATE TABLE Categories (
    CategoryID INT PRIMARY KEY,
    CategoryName VARCHAR(50) NOT NULL UNIQUE
);

CREATE TABLE Products (
    ProductID INT PRIMARY KEY,
    ProductName VARCHAR(100) NOT NULL UNIQUE,
    CategoryID INT,
    Price DECIMAL(10,2) NOT NULL,
    StockQuantity INT,
    FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);

CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(100) NOT NULL,
    Email VARCHAR(100) UNIQUE,
    JoinDate DATE
);

CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    OrderDate DATE NOT NULL,
    TotalAmount DECIMAL(10,2),
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);

-- 4. Insert Data

INSERT INTO Categories VALUES
(1, 'Electronics'),
(2, 'Books'),
(3, 'Home Goods'),
(4, 'Apparel');

INSERT INTO Products VALUES
(101, 'Laptop Pro', 1, 1200.00, 50),
(102, 'SQL Handbook', 2, 45.50, 200),
(103, 'Smart Speaker', 1, 99.99, 150),
(104, 'Coffee Maker', 3, 75.00, 80),
(105, 'Novel: The Great SQL', 2, 25.00, 120),
(106, 'Wireless Earbuds', 1, 150.00, 100),
(107, 'Blender X', 3, 120.00, 60),
(108, 'T-Shirt Casual', 4, 20.00, 300);

INSERT INTO Customers VALUES
(1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
(2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
(3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
(4, 'Diana Prince', 'diana@example.com', '2021-04-26');

INSERT INTO Orders VALUES
(1001, 1, '2023-04-26', 1245.50),
(1002, 2, '2023-10-12', 99.99),
(1003, 1, '2023-07-01', 145.00),
(1004, 3, '2023-01-14', 150.00),
(1005, 2, '2023-09-24', 120.00),
(1006, 1, '2023-06-19', 20.00);

In [ ]:
Question 7 : Generate a report showing CustomerName, Email, and the
TotalNumberofOrders for each customer. Include customers who have not placed
any orders, in which case their TotalNumberofOrders should be 0. Order the results
by CustomerName.

Program =>

-- Generate a report showing CustomerName, Email, and TotalNumberOfOrders
-- Include customers with 0 orders, ordered by CustomerName

SELECT
    c.CustomerName,
    c.Email,
    COUNT(o.OrderID) AS TotalNumberOfOrders
FROM
    Customers c
LEFT JOIN
    Orders o
ON
    c.CustomerID = o.CustomerID
GROUP BY
    c.CustomerName, c.Email
ORDER BY
    c.CustomerName;

In [ ]:
Question 8 : Retrieve Product Information with Category: Write a SQL query to
display the ProductName, Price, StockQuantity, and CategoryName for all
products. Order the results by CategoryName and then ProductName alphabetically.

Program =>

-- Display ProductName, Price, StockQuantity, and CategoryName
-- Order results by CategoryName, then ProductName alphabetically

SELECT
    p.ProductName,
    p.Price,
    p.StockQuantity,
    c.CategoryName
FROM
    Products p
INNER JOIN
    Categories c
ON
    p.CategoryID = c.CategoryID
ORDER BY
    c.CategoryName ASC,
    p.ProductName ASC;

In [ ]:
Question 9 : Write a SQL query that uses a Common Table Expression (CTE) and a
Window Function (specifically ROW_NUMBER() or RANK()) to display the
CategoryName, ProductName, and Price for the top 2 most expensive products in
each CategoryName.

Program =>

-- Top 2 most expensive products per category using CTE + ROW_NUMBER()

WITH RankedProducts AS (
    SELECT
        c.CategoryName,
        p.ProductName,
        p.Price,
        ROW_NUMBER() OVER (
            PARTITION BY c.CategoryName
            ORDER BY p.Price DESC
        ) AS RankInCategory
    FROM
        Products p
    INNER JOIN
        Categories c
    ON
        p.CategoryID = c.CategoryID
)
SELECT
    CategoryName,
    ProductName,
    Price
FROM
    RankedProducts
WHERE
    RankInCategory <= 2
ORDER BY
    CategoryName ASC,
    Price DESC;

In [ ]:
Question 10 : You are hired as a data analyst by Sakila Video Rentals, a global movie
rental company. The management team is looking to improve decision-making by
analyzing existing customer, rental, and inventory data.
Using the Sakila database, answer the following business questions to support key strategic
initiatives.
Tasks & Questions:
1. Identify the top 5 customers based on the total amount they’ve spent. Include customer
name, email, and total amount spent.
2. Which 3 movie categories have the highest rental counts? Display the category name
and number of times movies from that category were rented.
3. Calculate how many films are available at each store and how many of those have
never been rented.
4. Show the total revenue per month for the year 2023 to analyze business seasonality.
5. Identify customers who have rented more than 10 times in the last 6 months.

Program =>
1.

SELECT
    c.first_name AS CustomerFirstName,
    c.last_name AS CustomerLastName,
    c.email AS Email,
    SUM(p.amount) AS TotalAmountSpent
FROM
    customer c
JOIN
    payment p
ON
    c.customer_id = p.customer_id
GROUP BY
    c.customer_id, c.first_name, c.last_name, c.email
ORDER BY
    TotalAmountSpent DESC
LIMIT 5;

2.

SELECT
    cat.name AS CategoryName,
    COUNT(r.rental_id) AS RentalCount
FROM
    category cat
JOIN
    film_category fc ON cat.category_id = fc.category_id
JOIN
    inventory i ON fc.film_id = i.film_id
JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    cat.category_id, cat.name
ORDER BY
    RentalCount DESC
LIMIT 3;

3.

SELECT
    s.store_id,
    COUNT(DISTINCT i.film_id) AS TotalFilmsAvailable,
    COUNT(DISTINCT i.film_id) - COUNT(DISTINCT r.inventory_id) AS NeverRentedFilms
FROM
    store s
JOIN
    inventory i ON s.store_id = i.store_id
LEFT JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    s.store_id;

4.

SELECT
    DATE_FORMAT(p.payment_date, '%Y-%m') AS Month,
    SUM(p.amount) AS TotalRevenue
FROM
    payment p
WHERE
    YEAR(p.payment_date) = 2023
GROUP BY
    DATE_FORMAT(p.payment_date, '%Y-%m')
ORDER BY
    Month;

5.

SELECT
    c.first_name AS CustomerFirstName,
    c.last_name AS CustomerLastName,
    c.email AS Email,
    COUNT(r.rental_id) AS TotalRentals
FROM
    customer c
JOIN
    rental r ON c.customer_id = r.customer_id
WHERE
    r.rental_date >= DATE_SUB(CURDATE(), INTERVAL 6 MONTH)
GROUP BY
    c.customer_id, c.first_name, c.last_name, c.email
HAVING
    COUNT(r.rental_id) > 10
ORDER BY
    TotalRentals DESC;

Question 1 : Explain the fundamental differences between DDL, DML, and DQL
commands in SQL. Provide one example for each type of command.

Answer : In SQL, commands are categorized based on their purpose in managing and manipulating databases. The three key types are DDL, DML, and DQL.

1. DDL (Data Definition Language)
* Purpose: Defines and modifies the structure of database objects such as tables, schemas, or indexes.
* Effect: Changes the schema or structure of the database.
* Common Commands: CREATE, ALTER, DROP, TRUNCATE
* Example:

CREATE TABLE Students (

    StudentID INT PRIMARY KEY,
    Name VARCHAR(50),
    Age INT
);


This command creates a new table named Students.

2. DML (Data Manipulation Language)
* Purpose: Handles the manipulation of data stored in tables.
* Effect: Changes the actual data (not the structure).
* Common Commands: INSERT, UPDATE, DELETE
* Example:

INSERT INTO Students (StudentID, Name, Age)

VALUES (1, 'Riya Singh', 22);

This command adds a new record to the Students table.

3. DQL (Data Query Language)
* Purpose: Used to query and retrieve data from the database.
* Effect: Does not modify data; only fetches information.
* Common Command: SELECT
* Example:

SELECT Name, Age FROM Students WHERE Age > 20;

This command retrieves the names and ages of students older than 20.

Question 2 : What is the purpose of SQL constraints? Name and describe three common types
of constraints, providing a simple scenario where each would be useful.

Answer : Purpose of SQL Constraints:
SQL constraints are rules applied to table columns to ensure the accuracy, reliability, and integrity of the data stored in a database. They prevent invalid or inconsistent data from being entered.

1. PRIMARY KEY Constraint
* Purpose: Ensures each record in a table is uniquely identified.
* Rules: The column(s) defined as a primary key must be unique and not null.
* Scenario: In an employee database, each employee must have a unique ID — no two employees can share the same EmpID.

2. FOREIGN KEY Constraint
* Purpose: Maintains referential integrity between two tables by linking a column in one table to the primary key in another.
* Scenario: Ensures that an order cannot exist for an employee who isn’t listed in the Employees table.

3. CHECK Constraint
* Purpose: Ensures that the values in a column meet a specific condition.
* Scenario: Prevents entering a negative or zero price for a product, maintaining logical consistency.

Question 3 : Explain the difference between LIMIT and OFFSET clauses in SQL. How
would you use them together to retrieve the third page of results, assuming each page
has 10 records?

Answer : 1. LIMIT Clause
* Purpose: Restricts the number of rows returned by a query.
* Usage: LIMIT n returns only the first n rows from the result set.
* Example:

SELECT * FROM Students LIMIT 10;

This retrieves the first 10 records from the Students table.

2. OFFSET Clause
* Purpose: Skips a specified number of rows before starting to return records.
* Usage: OFFSET n skips the first n rows and begins displaying results after that point.
* Example:

SELECT * FROM Students OFFSET 10;

This skips the first 10 records and shows results starting from the 11th row.

3. Using LIMIT and OFFSET Together (Pagination)
To implement pagination (viewing results in pages), both are used together.

Scenario:
Each page displays 10 records, and we want to retrieve the third page.

* Page 1 → Records 1–10
* Page 2 → Records 11–20
* Page 3 → Records 21–30

Formula:

OFFSET = (page_number - 1) * records_per_page

So for page 3: (3 - 1) * 10 = 20

SQL Query:

SELECT * FROM Students
LIMIT 10 OFFSET 20;

Explanation:

* OFFSET 20 → skips the first 20 records.
* LIMIT 10 → retrieves the next 10 records (i.e., rows 21–30), which correspond to page 3.

Question 4 : What is a Common Table Expression (CTE) in SQL, and what are its main
benefits? Provide a simple SQL example demonstrating its usage.

Answer : 1. Definition

A Common Table Expression (CTE) is a temporary, named result set that you can reference within a SELECT, INSERT, UPDATE, or DELETE statement.
It is defined using the WITH keyword and exists only for the duration of the query.

2. Benefits of Using a CTE
* Improves Readability: Makes complex queries easier to understand and organize.
* Reusability: Allows the same result set to be referenced multiple times in a single query.
* Simplifies Recursive Queries: Useful for hierarchical data such as organizational charts or category trees.

3. Syntax

WITH cte_name AS (

    -- SQL query that defines the CTE
    SELECT ...

)

SELECT * FROM cte_name;


4. Example
Suppose we have an Employees table:

EmpID   Name    Department   Salary

1       Riya      HR          40000  

2       Aman       IT          60000

3       Neha        IT         55000

4       Ravi        HR         45000

We want to find employees earning above-average salaries.

SQL Query using CTE:-

WITH AvgSalary AS (

    SELECT Department, AVG(Salary) AS AvgDeptSalary
    FROM Employees
    GROUP BY Department
)

SELECT e.Name, e.Department, e.Salary

FROM Employees e

JOIN AvgSalary a

ON e.Department = a.Department

WHERE e.Salary > a.AvgDeptSalary;


Explanation:

* The CTE (AvgSalary) calculates the average salary per department.
* The main query then selects employees whose salaries exceed their department’s average.

Question 5 : Describe the concept of SQL Normalization and its primary goals. Briefly
explain the first three normal forms (1NF, 2NF, 3NF).

Answer : SQL Normalization is the process of organizing data in a database to reduce redundancy (duplicate data) and improve data integrity. It involves dividing large tables into smaller, related tables and defining relationships between them using foreign keys.

Primary Goals of Normalization

* Eliminate redundant data.
* Ensure data dependencies make sense (each piece of data is stored in the right place).
* Improve data consistency and integrity.
* Simplify data maintenance and updates.

1. First Normal Form (1NF)

* Each table cell must contain a single value (no multiple or repeating groups).
* Each record must be unique (identified by a primary key).

2. Second Normal Form (2NF)

* Must first satisfy 1NF.
* All non-key attributes must depend on the entire primary key, not just part of it (removes partial dependency).

3. Third Normal Form (3NF)

* Must first satisfy 2NF.
* There should be no transitive dependency — non-key attributes must depend only on the primary key, not on other non-key attributes.